function CommonUtilsWrapper() {

}

var commonUtils = new CommonUtilsWrapper();

CommonUtilsWrapper.prototype.autoServiceStart = function (time) {
    for (let i = 0; i < time; i++) {
        if (isServiceOk()) {
            return true;
        }
        let started = startEnv();
        logd("第" + (i + 1) + "次启动服务结果: " + started);
        if (isServiceOk()) {
            return true;
        }
    }
    return isServiceOk();
}

function randomPoem() {
    return MSG_ARRAY[randomNum(0, MSG_ARRAY.length -1)];
}

function randomNum(minNum, maxNum) {
    switch (arguments.length) {
        case 1:
            return parseInt(Math.random() * minNum + 1, 10);
            break;
        case 2:
            return parseInt(Math.random() * (maxNum - minNum + 1) + minNum, 10);
            break;
        default:
            return 0;
            break;
    }
}


const MSG_ARRAY = [
    //
    "红豆生南国，春来发几枝。\n" +
    "愿君多采撷，此物最相思。",

    //
    "功盖三分国，名成八阵图。\n" +
    "江流石不转，遗恨失吞吴。",

    //
    "向晚意不适，驱车登古原。\n" +
    "夕阳无限好，只是近黄昏。",

    //
    "独在异乡为异客，每逢佳节倍思亲。\n" +
    "遥知兄弟登高处，遍插茱萸少一人。",

    //
    "葡萄美酒夜光杯，欲饮琵琶马上催。\n" +
    "醉卧沙场君莫笑，古来征战几人回？",

    //
    "朱雀桥边野草花，乌衣巷口夕阳斜。\n" +
    "旧时王谢堂前燕，飞入寻常百姓家。",

    //
    "折戟沉沙铁未销，自将磨洗认前朝。\n" +
    "东风不与周郎便，铜雀春深锁二乔。",

    //
    "隐隐飞桥隔野烟，石矶西畔问渔船。\n" +
    "桃花尽日随流水，洞在清溪何处边。",

    //
    "月落乌啼霜满天，江枫渔火对愁眠。\n" +
    "姑苏城外寒山寺，夜半钟声到客船。",

    //
    "城阙辅三秦，风烟望五津。\n" +
    "与君离别意，同是宦游人。\n" +
    "海内存知己，天涯若比邻。\n" +
    "无为在歧路，儿女共沾巾。",

    //
    "昔闻洞庭水，今上岳阳楼。\n" +
    "吴楚东南坼，乾坤日夜浮。\n" +
    "亲朋无一字，老病有孤舟。\n" +
    "戎马关山北，凭轩涕泗流。",

    //
    "八月湖水平，涵虚混太清。\n" +
    "气蒸云梦泽，波撼岳阳城。\n" +
    "欲济无舟楫，端居耻圣明。\n" +
    "坐观垂钓者，徒有羡鱼情。",

    //
    "莺啼燕语报新年，马邑龙堆路几千。\n" +
    "家住层城临汉苑，心随明月到胡天。\n" +
    "机中锦字论长恨，楼上花枝笑独眠。\n" +
    "为问元戎窦车骑，何时返旆勒燕然。",

    //
    "下马饮君酒，问君何所之？\n" +
    "君言不得意，归卧南山陲。\n" +
    "但去莫复问，白云无尽时。",

    //
    "汉皇重色思倾国，御宇多年求不得。\n" +
    "杨家有女初长成，养在深闺人未识。\n" +
    "天生丽质难自弃，一朝选在君王侧。\n" +
    "回眸一笑百媚生，六宫粉黛无颜色。\n" +
    "春寒赐浴华清池，温泉水滑洗凝脂。\n" +
    "侍儿扶起娇无力，始是新承恩泽时。\n" +
    "云鬓花颜金步摇，芙蓉帐暖度春宵。\n" +
    "春宵苦短日高起，从此君王不早朝。\n" +
    "承欢侍宴无闲暇，春从春游夜专夜。\n" +
    "后宫佳丽三千人，三千宠爱在一身。\n" +
    "金屋妆成娇侍夜，玉楼宴罢醉和春。\n" +
    "姊妹弟兄皆列土，可怜光彩生门户。\n" +
    "遂令天下父母心，不重生男重生女。\n" +
    "骊宫高处入青云，仙乐风飘处处闻。\n" +
    "缓歌慢舞凝丝竹，尽日君王看不足。\n" +
    "\n" +
    "渔阳鼙鼓动地来，惊破霓裳羽衣曲。\n" +
    "九重城阙烟尘生，千乘万骑西南行。\n" +
    "翠华摇摇行复止，西出都门百余里。\n" +
    "六军不发无奈何，宛转蛾眉马前死。\n" +
    "花钿委地无人收，翠翘金雀玉搔头。\n" +
    "君王掩面救不得，回看血泪相和流。\n" +
    "黄埃散漫风萧索，云栈萦纡登剑阁。\n" +
    "峨嵋山下少人行，旌旗无光日色薄。\n" +
    "蜀江水碧蜀山青，圣主朝朝暮暮情。\n" +
    "行宫见月伤心色，夜雨闻铃肠断声。\n" +
    "天旋地转回龙驭，到此踌躇不能去。\n" +
    "马嵬坡下泥土中，不见玉颜空死处。\n" +
    "君臣相顾尽沾衣，东望都门信马归。\n" +
    "归来池苑皆依旧，太液芙蓉未央柳。\n" +
    "芙蓉如面柳如眉，对此如何不泪垂？\n" +
    "春风桃李花开夜，秋雨梧桐叶落时。\n" +
    "西宫南内多秋草，落叶满阶红不扫。\n" +
    "梨园弟子白发新，椒房阿监青娥老。\n" +
    "夕殿萤飞思悄然，孤灯挑尽未成眠。\n" +
    "迟迟钟鼓初长夜，耿耿星河欲曙天。\n" +
    "鸳鸯瓦冷霜华重，翡翠衾寒谁与共？\n" +
    "悠悠生死别经年，魂魄不曾来入梦。\n" +
    "\n" +
    "临邛道士鸿都客，能以精诚致魂魄。\n" +
    "为感君王辗转思，遂教方士殷勤觅。\n" +
    "排空驭气奔如电，升天入地求之遍。\n" +
    "上穷碧落下黄泉，两处茫茫皆不见。\n" +
    "忽闻海上有仙山，山在虚无缥缈间。\n" +
    "楼阁玲珑五云起，其中绰约多仙子。\n" +
    "中有一人字太真，雪肤花貌参差是。\n" +
    "金阙西厢叩玉扃，转教小玉报双成。\n" +
    "闻道汉家天子使，九华帐里梦魂惊。\n" +
    "揽衣推枕起徘徊，珠箔银屏迤逦开。\n" +
    "云鬓半偏新睡觉，花冠不整下堂来。\n" +
    "\n" +
    "风吹仙袂飘飖举，犹似霓裳羽衣舞。\n" +
    "玉容寂寞泪阑干，梨花一枝春带雨。\n" +
    "含情凝睇谢君王，一别音容两渺茫。\n" +
    "昭阳殿里恩爱绝，蓬莱宫中日月长。\n" +
    "回头下望人寰处，不见长安见尘雾。\n" +
    "惟将旧物表深情，钿合金钗寄将去。\n" +
    "钗留一股合一扇，钗擘黄金合分钿。\n" +
    "但令心似金钿坚，天上人间会相见。\n" +
    "\n" +
    "临别殷勤重寄词，词中有誓两心知。\n" +
    "七月七日长生殿，夜半无人私语时。\n" +
    "在天愿作比翼鸟，在地愿为连理枝。\n" +
    "天长地久有时尽，此恨绵绵无绝期。",

    //
    "浔阳江头夜送客，枫叶荻花秋瑟瑟。\n" +
    "主人下马客在船，举酒欲饮无管弦。\n" +
    "醉不成欢惨将别，别时茫茫江浸月。\n" +
    "\n" +
    "忽闻水上琵琶声，主人忘归客不发。\n" +
    "寻声暗问弹者谁，琵琶声停欲语迟。\n" +
    "移船相近邀相见，添酒回灯重开宴。\n" +
    "千呼万唤始出来，犹抱琵琶半遮面。\n" +
    "转轴拨弦三两声，未成曲调先有情。\n" +
    "弦弦掩抑声声思，似诉平生不得志。\n" +
    "低眉信手续续弹，说尽心中无限事。\n" +
    "轻拢慢捻抹复挑，初为霓裳后六幺。\n" +
    "大弦嘈嘈如急雨，小弦切切如私语。\n" +
    "嘈嘈切切错杂弹，大珠小珠落玉盘。\n" +
    "间关莺语花底滑，幽咽泉流冰下难。\n" +
    "冰泉冷涩弦凝绝，凝绝不通声暂歇。\n" +
    "别有幽愁暗恨生，此时无声胜有声。\n" +
    "银瓶乍破水浆迸，铁骑突出刀枪鸣。\n" +
    "曲终收拨当心画，四弦一声如裂帛。\n" +
    "东船西舫悄无言，唯见江心秋月白。\n" +
    "\n" +
    "沉吟放拨插弦中，整顿衣裳起敛容。\n" +
    "自言本是京城女，家在虾蟆陵下住。\n" +
    "十三学得琵琶成，名属教坊第一部。\n" +
    "曲罢曾教善才服，妆成每被秋娘妒。\n" +
    "五陵年少争缠头，一曲红绡不知数。\n" +
    "钿头银篦击节碎，血色罗裙翻酒污。\n" +
    "今年欢笑复明年，秋月春风等闲度。\n" +
    "弟走从军阿姨死，暮去朝来颜色故。\n" +
    "门前冷落鞍马稀，老大嫁作商人妇。\n" +
    "商人重利轻别离，前月浮梁买茶去。\n" +
    "去来江口守空船，绕船月明江水寒。\n" +
    "夜深忽梦少年事，梦啼妆泪红阑干。\n" +
    "\n" +
    "我闻琵琶已叹息，又闻此语重唧唧。\n" +
    "同是天涯沦落人，相逢何必曾相识！\n" +
    "我从去年辞帝京，谪居卧病浔阳城。\n" +
    "浔阳地僻无音乐，终岁不闻丝竹声。\n" +
    "住近湓江地低湿，黄芦苦竹绕宅生。\n" +
    "其间旦暮闻何物？杜鹃啼血猿哀鸣。\n" +
    "春江花朝秋月夜，往往取酒还独倾。\n" +
    "岂无山歌与村笛，呕哑嘲哳难为听。\n" +
    "今夜闻君琵琶语，如听仙乐耳暂明。\n" +
    "莫辞更坐弹一曲，为君翻作《琵琶行》。\n" +
    "\n" +
    "感我此言良久立，却坐促弦弦转急。\n" +
    "凄凄不似向前声，满座重闻皆掩泣。\n" +
    "座中泣下谁最多？江州司马青衫湿。",

    //
    "前不见古人，后不见来者。\n" +
    "念天地之悠悠，独怆然而涕下！",

    //
    "黄河远上白云间，一片孤城万仞山。\n" +
    "羌笛何须怨杨柳，春风不度玉门关。",

    //
    "车辚辚，马萧萧，行人弓箭各在腰。\n" +
    "耶娘妻子走相送，尘埃不见咸阳桥。\n" +
    "牵衣顿足拦道哭，哭声直上干云霄。\n" +
    "道旁过者问行人，行人但云点行频。\n" +
    "或从十五北防河，便至四十西营田。\n" +
    "去时里正与裹头，归来头白还戍边。\n" +
    "边庭流血成海水，武皇开边意未已。\n" +
    "君不闻汉家山东二百州，千村万落生荆杞。\n" +
    "纵有健妇把锄犁，禾生陇亩无东西。\n" +
    "况复秦兵耐苦战，被驱不异犬与鸡。\n" +
    "长者虽有问，役夫敢申恨？\n" +
    "且如今年冬，未休关西卒。\n" +
    "县官急索租，租税从何出？\n" +
    "信知生男恶，反是生女好。\n" +
    "生女犹得嫁比邻，生男埋没随百草。\n" +
    "君不见青海头，古来白骨无人收。\n" +
    "新鬼烦冤旧鬼哭，天阴雨湿声啾啾！",

    //
    "君不见黄河之水天上来，奔流到海不复回。\n" +
    "君不见高堂明镜悲白发，朝如青丝暮成雪。\n" +
    "人生得意须尽欢，莫使金樽空对月。\n" +
    "天生我材必有用，千金散尽还复来。\n" +
    "烹羊宰牛且为乐，会须一饮三百杯。\n" +
    "岑夫子，丹丘生，将进酒，杯莫停。\n" +
    "与君歌一曲，请君为我倾耳听。\n" +
    "钟鼓馔玉不足贵，但愿长醉不愿醒。\n" +
    "古来圣贤皆寂寞，惟有饮者留其名。\n" +
    "陈王昔时宴平乐，斗酒十千恣欢谑。\n" +
    "主人何为言少钱，径须沽取对君酌。\n" +
    "五花马、千金裘，呼儿将出换美酒，与尔同销万古愁。",];